---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkLoadResultType.LinkNotOpenable
enum: Autodesk.Revit.DB.LinkLoadResultType
source: html/11b095e1-24d9-91b9-ae2e-004f67c94d6e.htm
---
# Autodesk.Revit.DB.LinkLoadResultType.LinkNotOpenable

An error occurred trying to read the linked model. It could happen if
 a wrong link type is trying to be loaded.